/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "image_with_text": {
      "type": "image_with_text",
      "settings": {
        "image_image": "shopify://shop_images/pricay-with-proximity.webp",
        "text_heading": "Welcome to Challet Contessa",
        "richtext_paragraph": "",
        "url_button_link": "shopify://pages/the-spirit-of-challet-contessa",
        "text_button_text": "The Spirit of Challet Contessa",
        "url_button_link_2": "shopify://pages/the-spirit-of-challet-contessa",
        "text_button_text_2": "Neighboring Treasures"
      }
    },
    "large_image": {
      "type": "large_image",
      "settings": {
        "text_headline": "A private sanctuary for life, legacy, and the art of living beautifully.",
        "text_paragraph": "Nestled along the banks of the Eagle River between Avon and Edwards in Colorado’s renowned Vail Valley, Chalet Contessa is more than a destination—it is an immersive experience. With panoramic views of the river, Arrowhead Golf Course, and Beaver Creek Mountain, this luxurious retreat blends the grandeur of the Rockies with the elegance of European refinement.<br><br>Born from the legacy of The Vintage Contessa & Times Past—internationally recognized for curating rare, authentic luxury—Chalet Contessa represents the next evolution of our brand: a place where meaningful connection, exceptional beauty, and timeless elegance come together. Designed for those who seek soulful luxury, it offers an atmosphere that feels both couture and comfortably lived-in, intimate yet unforgettable."
      }
    },
    "offset_image": {
      "type": "offset_image",
      "settings": {
        "text_paragraph": "Set on more than an acre of riverfront land, the chalet features seamless indoor–outdoor living with private patios and beautifully expanded entertaining spaces. A heated glass pergola, riverside hot tub, illuminated 50\" blue spruce, and sculptural fire pit create intimate gathering moments in every season. Beyond the patios, more than 2,500 sq ft of level turf transforms the grounds into a stunning venue for celebrations—extending the entertaining footprint by over 5,000 sq ft and making Chalet Contessa as unforgettable outdoors as it is within."
      }
    },
    "simple": {
      "type": "simple",
      "settings": {
        "text_paragraph": "Originally built in 1984 and stewarded by our family for over two decades, the estate has been thoughtfully transformed into a couture-inspired home. Hermès scarves double as artwork, Louis Vuitton trunks become furniture, and textiles from Missoni, Dolce &amp; Gabbana, Schumacher, and Brunschwig &amp; Fils mingle with curated art and custom furnishings. Every detail reflects our belief that luxury is not about excess but about intention, craftsmanship, and stories that endure."
      }
    },
    "large_image_2": {
      "type": "large_image_2",
      "settings": {
        "text_paragraph_1": "Whether hosting a milestone celebration, an intimate retreat, a bespoke wedding, or a luxury brand gathering, Chalet Contessa offers an exclusive environment with limited availability—ensuring privacy, prestige, and a sense of mystique reminiscent of Alpine chalets, Italian villas, and French châteaux.",
        "text_paragraph_2": "From its heritage roots to its couture details, Chalet Contessa is curated for connection: a boutique-style escape where the river sets the pace, the mountains frame the moment, and design elevates every experience.",
        "text_headline": "A private sanctuary for life, legacy, and the art of living beautifully.",
        "text_paragraph_3": "Chalet Contessa is not just a property. It is a living legacy—a home for heartfelt gatherings, extraordinary stories, and life’s most meaningful moments."
      }
    }
  },
  "layout": "theme",
  "wrapper": "div.main-wrapper",
  "order": [
    "image_with_text",
    "large_image",
    "offset_image",
    "simple",
    "large_image_2"
  ]
}
