/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "small_hero": {
      "type": "small_hero",
      "settings": {
        "text_headline": "The spirit of Chalet Contessa is where timeless alpine glamour meets modern mountain living.",
        "richtext_text": "<p>Inspired by the iconic photography and art, the design blends classic European luxury with the adventurous spirit of the Rockies—delivering a curated, comfortable elegance that feels both storied and striking now.</p>"
      }
    },
    "travel": {
      "type": "travel",
      "settings": {
        "text_travel_option_1": "Fly Into Eagle County Regional Airport (EGE)",
        "richtext_travel_details_1": "<p><strong>Distance:</strong> ~30 minutes from Chalet Contessa</p><p>For the quickest and most comfortable mountain arrival, Eagle (EGE) is the ideal airport.<br/><br/></p><ul><li><strong>Winter direct flights</strong> are commonly available from <strong>Houston (United)</strong>, <strong>Dallas (American)</strong>, <strong>New York</strong>, <strong>Miami</strong>, <strong>Chicago</strong>, <strong>Atlanta</strong>, and more.<br/><br/></li><li>Year-round, guests may also <strong>connect through Denver</strong> for a short, scenic flight into the valley.<br/><br/></li></ul><p>We are happy to <strong>provide suggestions for ground transportation</strong> directly to Chalet Contessa, or you may choose to <strong>Uber from the airport</strong> for added convenience.</p>",
        "text_travel_option_2": "Fly Into Denver International Airport (DEN)",
        "richtext_travel_details_2": "<p><strong>Distance:</strong> ~2 to 2.5 hours (weather dependent)<br/><br/>Many guests choose Denver for its numerous flight options and then enjoy:<br/><br/></p><ul><li>a relaxing <strong>Epic Mountain Shuttle</strong> ride directly to Avon, Vail, or Beaver Creek — <strong>with discounts for Epic Pass holders</strong>, or<br/><br/></li><li>a <strong>rental car</strong> for a beautiful drive through the Rockies<br/><br/></li></ul><p>Denver is an excellent option for families, groups, or guests wanting a scenic entry into the mountains.</p>",
        "text_travel_option_3": "Ground Transportation",
        "richtext_travel_details_3": "<p><br/>                    <strong>Epic Mountain Shuttle</strong><br/>                    Professional, door-to-door service from both Denver and Eagle, accustomed to winter mountain conditions.<br/>                    ‍<br/>                    <strong>Uber / Ride Services</strong><br/>                    Easily accessible from Eagle Airport for a smooth, no-planning-required arrival.<br/>                    ‍<br/>                    <strong>Rental Cars</strong><br/>                    Readily available a</p>"
      }
    }
  },
  "layout": "theme",
  "wrapper": "main.main-wrapper",
  "order": [
    "small_hero",
    "travel"
  ]
}
